IdeaRS.Connections
ConnectionData Properties
Compatible with IDEA StatiCa 0.0
The ConnectionData type exposes the following members.
Properties
Name | Description
BeamProperties
 Gets or sets the properties of the cennected beams
BeamSequence
 Gets or sets the manufacturing sequence
NodeId
 Gets or sets the Id of the corresponding node in the structure
Properties
 Gets or sets the properties of the connection
Sequence
 Gets or sets the manufacturing sequence
Top
See Also
Reference
ConnectionData Class
IdeaRS.Connections.Data Namespace